/* automatically generated by rust-bindgen 0.69.4 */

pub const NDILIB_LIBRARY_NAME: &[u8; 27] = b"Processing.NDI.Lib.x64.dll\0";
pub const NDILIB_REDIST_FOLDER: &[u8; 19] = b"NDI_RUNTIME_DIR_V6\0";
pub const NDILIB_REDIST_URL: &[u8; 28] = b"http://ndi.link/NDIRedistV6\0";
pub const NDILIB_CPP_DEFAULT_CONSTRUCTORS: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const false_: u32 = 0;
pub const true_: u32 = 1;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}

pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_type_NV12: NDIlib_FourCC_video_type_e =
    842094158;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_video_type_BGRA: NDIlib_FourCC_video_type_e =
    1095911234;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_type_BGRA: NDIlib_FourCC_video_type_e =
    1095911234;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_video_type_BGRX: NDIlib_FourCC_video_type_e =
    1481787202;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_type_BGRX: NDIlib_FourCC_video_type_e =
    1481787202;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_video_type_RGBA: NDIlib_FourCC_video_type_e =
    1094862674;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_type_RGBA: NDIlib_FourCC_video_type_e =
    1094862674;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_video_type_RGBX: NDIlib_FourCC_video_type_e =
    1480738642;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_type_RGBX: NDIlib_FourCC_video_type_e =
    1480738642;
pub const NDIlib_FourCC_video_type_e_NDIlib_FourCC_video_type_max: NDIlib_FourCC_video_type_e =
    2147483647;
pub type NDIlib_FourCC_video_type_e = ::std::os::raw::c_int;
pub use self::NDIlib_FourCC_video_type_e as NDIlib_FourCC_type_e;
pub const NDIlib_FourCC_audio_type_e_NDIlib_FourCC_audio_type_FLTP: NDIlib_FourCC_audio_type_e =
    1884572742;
pub const NDIlib_FourCC_audio_type_e_NDIlib_FourCC_type_FLTP: NDIlib_FourCC_audio_type_e =
    1884572742;
pub const NDIlib_FourCC_audio_type_e_NDIlib_FourCC_audio_type_max: NDIlib_FourCC_audio_type_e =
    2147483647;
pub type NDIlib_FourCC_audio_type_e = ::std::os::raw::c_int;
pub const NDIlib_frame_format_type_e_NDIlib_frame_format_type_progressive:
    NDIlib_frame_format_type_e = 1;
pub const NDIlib_frame_format_type_e_NDIlib_frame_format_type_interleaved:
    NDIlib_frame_format_type_e = 0;
pub const NDIlib_frame_format_type_e_NDIlib_frame_format_type_field_0: NDIlib_frame_format_type_e =
    2;
pub const NDIlib_frame_format_type_e_NDIlib_frame_format_type_field_1: NDIlib_frame_format_type_e =
    3;
pub const NDIlib_frame_format_type_e_NDIlib_frame_format_type_max: NDIlib_frame_format_type_e =
    2147483647;
pub type NDIlib_frame_format_type_e = ::std::os::raw::c_int;
pub const NDIlib_send_timecode_synthesize: i64 = 9223372036854775807;
pub const NDIlib_recv_timestamp_undefined: i64 = 9223372036854775807;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NDIlib_source_t {
    pub p_ndi_name: *const ::std::os::raw::c_char,
    pub __bindgen_anon_1: NDIlib_source_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_source_t__bindgen_ty_1 {
    pub p_url_address: *const ::std::os::raw::c_char,
    pub p_ip_address: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_NDIlib_source_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_source_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_source_t__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_source_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_source_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_source_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_url_address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_source_t__bindgen_ty_1),
            "::",
            stringify!(p_url_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_ip_address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_source_t__bindgen_ty_1),
            "::",
            stringify!(p_ip_address)
        )
    );
}
#[test]
fn bindgen_test_layout_NDIlib_source_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_source_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_source_t>(),
        16usize,
        concat!("Size of: ", stringify!(NDIlib_source_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_source_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_source_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_ndi_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_source_t),
            "::",
            stringify!(p_ndi_name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NDIlib_video_frame_v2_t {
    pub xres: ::std::os::raw::c_int,
    pub yres: ::std::os::raw::c_int,
    pub FourCC: NDIlib_FourCC_video_type_e,
    pub frame_rate_N: ::std::os::raw::c_int,
    pub frame_rate_D: ::std::os::raw::c_int,
    pub picture_aspect_ratio: f32,
    pub frame_format_type: NDIlib_frame_format_type_e,
    pub timecode: i64,
    pub p_data: *mut u8,
    pub __bindgen_anon_1: NDIlib_video_frame_v2_t__bindgen_ty_1,
    pub p_metadata: *const ::std::os::raw::c_char,
    pub timestamp: i64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_video_frame_v2_t__bindgen_ty_1 {
    pub line_stride_in_bytes: ::std::os::raw::c_int,
    pub data_size_in_bytes: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NDIlib_video_frame_v2_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_video_frame_v2_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_video_frame_v2_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(NDIlib_video_frame_v2_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_video_frame_v2_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NDIlib_video_frame_v2_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line_stride_in_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t__bindgen_ty_1),
            "::",
            stringify!(line_stride_in_bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_size_in_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t__bindgen_ty_1),
            "::",
            stringify!(data_size_in_bytes)
        )
    );
}
#[test]
fn bindgen_test_layout_NDIlib_video_frame_v2_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_video_frame_v2_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_video_frame_v2_t>(),
        72usize,
        concat!("Size of: ", stringify!(NDIlib_video_frame_v2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_video_frame_v2_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_video_frame_v2_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xres) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(xres)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yres) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(yres)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FourCC) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(FourCC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_rate_N) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(frame_rate_N)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_rate_D) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(frame_rate_D)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).picture_aspect_ratio) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(picture_aspect_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_format_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(frame_format_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(p_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_metadata) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(p_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_v2_t),
            "::",
            stringify!(timestamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_audio_frame_v2_t {
    pub sample_rate: ::std::os::raw::c_int,
    pub no_channels: ::std::os::raw::c_int,
    pub no_samples: ::std::os::raw::c_int,
    pub timecode: i64,
    pub p_data: *mut f32,
    pub channel_stride_in_bytes: ::std::os::raw::c_int,
    pub p_metadata: *const ::std::os::raw::c_char,
    pub timestamp: i64,
}
#[test]
fn bindgen_test_layout_NDIlib_audio_frame_v2_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_audio_frame_v2_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_audio_frame_v2_t>(),
        56usize,
        concat!("Size of: ", stringify!(NDIlib_audio_frame_v2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_audio_frame_v2_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_audio_frame_v2_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(no_channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(no_samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(p_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_stride_in_bytes) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(channel_stride_in_bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_metadata) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(p_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v2_t),
            "::",
            stringify!(timestamp)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NDIlib_audio_frame_v3_t {
    pub sample_rate: ::std::os::raw::c_int,
    pub no_channels: ::std::os::raw::c_int,
    pub no_samples: ::std::os::raw::c_int,
    pub timecode: i64,
    pub FourCC: NDIlib_FourCC_audio_type_e,
    pub p_data: *mut u8,
    pub __bindgen_anon_1: NDIlib_audio_frame_v3_t__bindgen_ty_1,
    pub p_metadata: *const ::std::os::raw::c_char,
    pub timestamp: i64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_audio_frame_v3_t__bindgen_ty_1 {
    pub channel_stride_in_bytes: ::std::os::raw::c_int,
    pub data_size_in_bytes: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NDIlib_audio_frame_v3_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_audio_frame_v3_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_audio_frame_v3_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(NDIlib_audio_frame_v3_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_audio_frame_v3_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(NDIlib_audio_frame_v3_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_stride_in_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t__bindgen_ty_1),
            "::",
            stringify!(channel_stride_in_bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_size_in_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t__bindgen_ty_1),
            "::",
            stringify!(data_size_in_bytes)
        )
    );
}
#[test]
fn bindgen_test_layout_NDIlib_audio_frame_v3_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_audio_frame_v3_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_audio_frame_v3_t>(),
        64usize,
        concat!("Size of: ", stringify!(NDIlib_audio_frame_v3_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_audio_frame_v3_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_audio_frame_v3_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(no_channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(no_samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FourCC) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(FourCC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(p_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_metadata) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(p_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_v3_t),
            "::",
            stringify!(timestamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_metadata_frame_t {
    pub length: ::std::os::raw::c_int,
    pub timecode: i64,
    pub p_data: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_NDIlib_metadata_frame_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_metadata_frame_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_metadata_frame_t>(),
        24usize,
        concat!("Size of: ", stringify!(NDIlib_metadata_frame_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_metadata_frame_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_metadata_frame_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_metadata_frame_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_metadata_frame_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_metadata_frame_t),
            "::",
            stringify!(p_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_tally_t {
    pub on_program: bool,
    pub on_preview: bool,
}
#[test]
fn bindgen_test_layout_NDIlib_tally_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_tally_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_tally_t>(),
        2usize,
        concat!("Size of: ", stringify!(NDIlib_tally_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_tally_t>(),
        1usize,
        concat!("Alignment of ", stringify!(NDIlib_tally_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).on_program) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_tally_t),
            "::",
            stringify!(on_program)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).on_preview) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_tally_t),
            "::",
            stringify!(on_preview)
        )
    );
}
extern "C" {
    pub fn NDIlib_initialize() -> bool;
}
extern "C" {
    pub fn NDIlib_destroy();
}
extern "C" {
    pub fn NDIlib_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn NDIlib_is_supported_CPU() -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_find_instance_type {
    _unused: [u8; 0],
}
pub type NDIlib_find_instance_t = *mut NDIlib_find_instance_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_find_create_t {
    pub show_local_sources: bool,
    pub p_groups: *const ::std::os::raw::c_char,
    pub p_extra_ips: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_NDIlib_find_create_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_find_create_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_find_create_t>(),
        24usize,
        concat!("Size of: ", stringify!(NDIlib_find_create_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_find_create_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_find_create_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).show_local_sources) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_find_create_t),
            "::",
            stringify!(show_local_sources)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_groups) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_find_create_t),
            "::",
            stringify!(p_groups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_extra_ips) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_find_create_t),
            "::",
            stringify!(p_extra_ips)
        )
    );
}
extern "C" {
    pub fn NDIlib_find_create_v2(
        p_create_settings: *const NDIlib_find_create_t,
    ) -> NDIlib_find_instance_t;
}
extern "C" {
    pub fn NDIlib_find_destroy(p_instance: NDIlib_find_instance_t);
}
extern "C" {
    pub fn NDIlib_find_get_current_sources(
        p_instance: NDIlib_find_instance_t,
        p_no_sources: *mut u32,
    ) -> *const NDIlib_source_t;
}
extern "C" {
    pub fn NDIlib_find_wait_for_sources(
        p_instance: NDIlib_find_instance_t,
        timeout_in_ms: u32,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_recv_instance_type {
    _unused: [u8; 0],
}
pub type NDIlib_recv_instance_t = *mut NDIlib_recv_instance_type;
pub const NDIlib_recv_bandwidth_e_NDIlib_recv_bandwidth_metadata_only: NDIlib_recv_bandwidth_e =
    -10;
pub const NDIlib_recv_bandwidth_e_NDIlib_recv_bandwidth_audio_only: NDIlib_recv_bandwidth_e = 10;
pub const NDIlib_recv_bandwidth_e_NDIlib_recv_bandwidth_lowest: NDIlib_recv_bandwidth_e = 0;
pub const NDIlib_recv_bandwidth_e_NDIlib_recv_bandwidth_highest: NDIlib_recv_bandwidth_e = 100;
pub const NDIlib_recv_bandwidth_e_NDIlib_recv_bandwidth_max: NDIlib_recv_bandwidth_e = 2147483647;
pub type NDIlib_recv_bandwidth_e = ::std::os::raw::c_int;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_BGRX_BGRA:
    NDIlib_recv_color_format_e = 0;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_UYVY_BGRA:
    NDIlib_recv_color_format_e = 1;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_RGBX_RGBA:
    NDIlib_recv_color_format_e = 2;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_UYVY_RGBA:
    NDIlib_recv_color_format_e = 3;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_fastest: NDIlib_recv_color_format_e =
    100;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_best: NDIlib_recv_color_format_e =
    101;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_e_BGRX_BGRA:
    NDIlib_recv_color_format_e = 0;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_e_UYVY_BGRA:
    NDIlib_recv_color_format_e = 1;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_e_RGBX_RGBA:
    NDIlib_recv_color_format_e = 2;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_e_UYVY_RGBA:
    NDIlib_recv_color_format_e = 3;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_BGRX_BGRA_flipped:
    NDIlib_recv_color_format_e = 1000;
pub const NDIlib_recv_color_format_e_NDIlib_recv_color_format_max: NDIlib_recv_color_format_e =
    2147483647;
pub type NDIlib_recv_color_format_e = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NDIlib_recv_create_v3_t {
    pub source_to_connect_to: NDIlib_source_t,
    pub color_format: NDIlib_recv_color_format_e,
    pub bandwidth: NDIlib_recv_bandwidth_e,
    pub allow_video_fields: bool,
    pub p_ndi_recv_name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_NDIlib_recv_create_v3_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_recv_create_v3_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_recv_create_v3_t>(),
        40usize,
        concat!("Size of: ", stringify!(NDIlib_recv_create_v3_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_recv_create_v3_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_recv_create_v3_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).source_to_connect_to) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_v3_t),
            "::",
            stringify!(source_to_connect_to)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_format) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_v3_t),
            "::",
            stringify!(color_format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bandwidth) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_v3_t),
            "::",
            stringify!(bandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allow_video_fields) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_v3_t),
            "::",
            stringify!(allow_video_fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_ndi_recv_name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_v3_t),
            "::",
            stringify!(p_ndi_recv_name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_recv_performance_t {
    pub video_frames: i64,
    pub audio_frames: i64,
    pub metadata_frames: i64,
}
#[test]
fn bindgen_test_layout_NDIlib_recv_performance_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_recv_performance_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_recv_performance_t>(),
        24usize,
        concat!("Size of: ", stringify!(NDIlib_recv_performance_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_recv_performance_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_recv_performance_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).video_frames) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_performance_t),
            "::",
            stringify!(video_frames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).audio_frames) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_performance_t),
            "::",
            stringify!(audio_frames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).metadata_frames) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_performance_t),
            "::",
            stringify!(metadata_frames)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_recv_queue_t {
    pub video_frames: ::std::os::raw::c_int,
    pub audio_frames: ::std::os::raw::c_int,
    pub metadata_frames: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NDIlib_recv_queue_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_recv_queue_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_recv_queue_t>(),
        12usize,
        concat!("Size of: ", stringify!(NDIlib_recv_queue_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_recv_queue_t>(),
        4usize,
        concat!("Alignment of ", stringify!(NDIlib_recv_queue_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).video_frames) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_queue_t),
            "::",
            stringify!(video_frames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).audio_frames) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_queue_t),
            "::",
            stringify!(audio_frames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).metadata_frames) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_queue_t),
            "::",
            stringify!(metadata_frames)
        )
    );
}
extern "C" {
    pub fn NDIlib_recv_create_v3(
        p_create_settings: *const NDIlib_recv_create_v3_t,
    ) -> NDIlib_recv_instance_t;
}
extern "C" {
    pub fn NDIlib_recv_destroy(p_instance: NDIlib_recv_instance_t);
}
extern "C" {
    pub fn NDIlib_recv_connect(p_instance: NDIlib_recv_instance_t, p_src: *const NDIlib_source_t);
}
extern "C" {
    pub fn NDIlib_recv_capture_v2(
        p_instance: NDIlib_recv_instance_t,
        p_video_data: *mut NDIlib_video_frame_v2_t,
        p_audio_data: *mut NDIlib_audio_frame_v2_t,
        p_metadata: *mut NDIlib_metadata_frame_t,
        timeout_in_ms: u32,
    ) -> NDIlib_frame_type_e;
}
extern "C" {
    pub fn NDIlib_recv_capture_v3(
        p_instance: NDIlib_recv_instance_t,
        p_video_data: *mut NDIlib_video_frame_v2_t,
        p_audio_data: *mut NDIlib_audio_frame_v3_t,
        p_metadata: *mut NDIlib_metadata_frame_t,
        timeout_in_ms: u32,
    ) -> NDIlib_frame_type_e;
}
extern "C" {
    pub fn NDIlib_recv_free_video_v2(
        p_instance: NDIlib_recv_instance_t,
        p_video_data: *const NDIlib_video_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_free_audio_v2(
        p_instance: NDIlib_recv_instance_t,
        p_audio_data: *const NDIlib_audio_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_free_audio_v3(
        p_instance: NDIlib_recv_instance_t,
        p_audio_data: *const NDIlib_audio_frame_v3_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_free_metadata(
        p_instance: NDIlib_recv_instance_t,
        p_metadata: *const NDIlib_metadata_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_free_string(
        p_instance: NDIlib_recv_instance_t,
        p_string: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn NDIlib_recv_send_metadata(
        p_instance: NDIlib_recv_instance_t,
        p_metadata: *const NDIlib_metadata_frame_t,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_set_tally(
        p_instance: NDIlib_recv_instance_t,
        p_tally: *const NDIlib_tally_t,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_get_performance(
        p_instance: NDIlib_recv_instance_t,
        p_total: *mut NDIlib_recv_performance_t,
        p_dropped: *mut NDIlib_recv_performance_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_get_queue(
        p_instance: NDIlib_recv_instance_t,
        p_total: *mut NDIlib_recv_queue_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_clear_connection_metadata(p_instance: NDIlib_recv_instance_t);
}
extern "C" {
    pub fn NDIlib_recv_add_connection_metadata(
        p_instance: NDIlib_recv_instance_t,
        p_metadata: *const NDIlib_metadata_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_get_no_connections(
        p_instance: NDIlib_recv_instance_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn NDIlib_recv_get_web_control(
        p_instance: NDIlib_recv_instance_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn NDIlib_recv_ptz_is_supported(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_recording_is_supported(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_zoom(p_instance: NDIlib_recv_instance_t, zoom_value: f32) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_zoom_speed(p_instance: NDIlib_recv_instance_t, zoom_speed: f32) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_pan_tilt(
        p_instance: NDIlib_recv_instance_t,
        pan_value: f32,
        tilt_value: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_pan_tilt_speed(
        p_instance: NDIlib_recv_instance_t,
        pan_speed: f32,
        tilt_speed: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_store_preset(
        p_instance: NDIlib_recv_instance_t,
        preset_no: ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_recall_preset(
        p_instance: NDIlib_recv_instance_t,
        preset_no: ::std::os::raw::c_int,
        speed: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_auto_focus(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_focus(p_instance: NDIlib_recv_instance_t, focus_value: f32) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_focus_speed(
        p_instance: NDIlib_recv_instance_t,
        focus_speed: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_white_balance_auto(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_white_balance_indoor(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_white_balance_outdoor(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_white_balance_oneshot(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_white_balance_manual(
        p_instance: NDIlib_recv_instance_t,
        red: f32,
        blue: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_exposure_auto(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_exposure_manual(
        p_instance: NDIlib_recv_instance_t,
        exposure_level: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_ptz_exposure_manual_v2(
        p_instance: NDIlib_recv_instance_t,
        iris: f32,
        gain: f32,
        shutter_speed: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_recording_start(
        p_instance: NDIlib_recv_instance_t,
        p_filename_hint: *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_recording_stop(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_recording_set_audio_level(
        p_instance: NDIlib_recv_instance_t,
        level_dB: f32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_recording_is_recording(p_instance: NDIlib_recv_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_recv_recording_get_filename(
        p_instance: NDIlib_recv_instance_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn NDIlib_recv_recording_get_error(
        p_instance: NDIlib_recv_instance_t,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_recv_recording_time_t {
    pub no_frames: i64,
    pub start_time: i64,
    pub last_time: i64,
}
#[test]
fn bindgen_test_layout_NDIlib_recv_recording_time_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_recv_recording_time_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_recv_recording_time_t>(),
        24usize,
        concat!("Size of: ", stringify!(NDIlib_recv_recording_time_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_recv_recording_time_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_recv_recording_time_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_frames) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_recording_time_t),
            "::",
            stringify!(no_frames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_recording_time_t),
            "::",
            stringify!(start_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_time) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_recording_time_t),
            "::",
            stringify!(last_time)
        )
    );
}
extern "C" {
    pub fn NDIlib_recv_recording_get_times(
        p_instance: NDIlib_recv_instance_t,
        p_times: *mut NDIlib_recv_recording_time_t,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_send_instance_type {
    _unused: [u8; 0],
}
pub type NDIlib_send_instance_t = *mut NDIlib_send_instance_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_send_create_t {
    pub p_ndi_name: *const ::std::os::raw::c_char,
    pub p_groups: *const ::std::os::raw::c_char,
    pub clock_video: bool,
    pub clock_audio: bool,
}
#[test]
fn bindgen_test_layout_NDIlib_send_create_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_send_create_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_send_create_t>(),
        24usize,
        concat!("Size of: ", stringify!(NDIlib_send_create_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_send_create_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_send_create_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_ndi_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_send_create_t),
            "::",
            stringify!(p_ndi_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_groups) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_send_create_t),
            "::",
            stringify!(p_groups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock_video) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_send_create_t),
            "::",
            stringify!(clock_video)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock_audio) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_send_create_t),
            "::",
            stringify!(clock_audio)
        )
    );
}
extern "C" {
    pub fn NDIlib_send_create(
        p_create_settings: *const NDIlib_send_create_t,
    ) -> NDIlib_send_instance_t;
}
extern "C" {
    pub fn NDIlib_send_destroy(p_instance: NDIlib_send_instance_t);
}
extern "C" {
    pub fn NDIlib_send_send_video_v2(
        p_instance: NDIlib_send_instance_t,
        p_video_data: *const NDIlib_video_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_send_send_video_async_v2(
        p_instance: NDIlib_send_instance_t,
        p_video_data: *const NDIlib_video_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_send_send_audio_v2(
        p_instance: NDIlib_send_instance_t,
        p_audio_data: *const NDIlib_audio_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_send_send_audio_v3(
        p_instance: NDIlib_send_instance_t,
        p_audio_data: *const NDIlib_audio_frame_v3_t,
    );
}
extern "C" {
    pub fn NDIlib_send_send_metadata(
        p_instance: NDIlib_send_instance_t,
        p_metadata: *const NDIlib_metadata_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_send_capture(
        p_instance: NDIlib_send_instance_t,
        p_metadata: *mut NDIlib_metadata_frame_t,
        timeout_in_ms: u32,
    ) -> NDIlib_frame_type_e;
}
extern "C" {
    pub fn NDIlib_send_free_metadata(
        p_instance: NDIlib_send_instance_t,
        p_metadata: *const NDIlib_metadata_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_send_get_tally(
        p_instance: NDIlib_send_instance_t,
        p_tally: *mut NDIlib_tally_t,
        timeout_in_ms: u32,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_send_get_no_connections(
        p_instance: NDIlib_send_instance_t,
        timeout_in_ms: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn NDIlib_send_clear_connection_metadata(p_instance: NDIlib_send_instance_t);
}
extern "C" {
    pub fn NDIlib_send_add_connection_metadata(
        p_instance: NDIlib_send_instance_t,
        p_metadata: *const NDIlib_metadata_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_send_set_failover(
        p_instance: NDIlib_send_instance_t,
        p_failover_source: *const NDIlib_source_t,
    );
}
extern "C" {
    pub fn NDIlib_send_get_source_name(
        p_instance: NDIlib_send_instance_t,
    ) -> *const NDIlib_source_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_routing_instance_type {
    _unused: [u8; 0],
}
pub type NDIlib_routing_instance_t = *mut NDIlib_routing_instance_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_routing_create_t {
    pub p_ndi_name: *const ::std::os::raw::c_char,
    pub p_groups: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_NDIlib_routing_create_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_routing_create_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_routing_create_t>(),
        16usize,
        concat!("Size of: ", stringify!(NDIlib_routing_create_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_routing_create_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_routing_create_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_ndi_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_routing_create_t),
            "::",
            stringify!(p_ndi_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_groups) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_routing_create_t),
            "::",
            stringify!(p_groups)
        )
    );
}
extern "C" {
    pub fn NDIlib_routing_create(
        p_create_settings: *const NDIlib_routing_create_t,
    ) -> NDIlib_routing_instance_t;
}
extern "C" {
    pub fn NDIlib_routing_destroy(p_instance: NDIlib_routing_instance_t);
}
extern "C" {
    pub fn NDIlib_routing_change(
        p_instance: NDIlib_routing_instance_t,
        p_source: *const NDIlib_source_t,
    ) -> bool;
}
extern "C" {
    pub fn NDIlib_routing_clear(p_instance: NDIlib_routing_instance_t) -> bool;
}
extern "C" {
    pub fn NDIlib_routing_get_no_connections(
        p_instance: NDIlib_routing_instance_t,
        timeout_in_ms: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn NDIlib_routing_get_source_name(
        p_instance: NDIlib_routing_instance_t,
    ) -> *const NDIlib_source_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_audio_frame_interleaved_16s_t {
    pub sample_rate: ::std::os::raw::c_int,
    pub no_channels: ::std::os::raw::c_int,
    pub no_samples: ::std::os::raw::c_int,
    pub timecode: i64,
    pub reference_level: ::std::os::raw::c_int,
    pub p_data: *mut i16,
}
#[test]
fn bindgen_test_layout_NDIlib_audio_frame_interleaved_16s_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_audio_frame_interleaved_16s_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_audio_frame_interleaved_16s_t>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_audio_frame_interleaved_16s_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t),
            "::",
            stringify!(no_channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t),
            "::",
            stringify!(no_samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_level) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t),
            "::",
            stringify!(reference_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_16s_t),
            "::",
            stringify!(p_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_audio_frame_interleaved_32s_t {
    pub sample_rate: ::std::os::raw::c_int,
    pub no_channels: ::std::os::raw::c_int,
    pub no_samples: ::std::os::raw::c_int,
    pub timecode: i64,
    pub reference_level: ::std::os::raw::c_int,
    pub p_data: *mut i32,
}
#[test]
fn bindgen_test_layout_NDIlib_audio_frame_interleaved_32s_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_audio_frame_interleaved_32s_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_audio_frame_interleaved_32s_t>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_audio_frame_interleaved_32s_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t),
            "::",
            stringify!(no_channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t),
            "::",
            stringify!(no_samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reference_level) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t),
            "::",
            stringify!(reference_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32s_t),
            "::",
            stringify!(p_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_audio_frame_interleaved_32f_t {
    pub sample_rate: ::std::os::raw::c_int,
    pub no_channels: ::std::os::raw::c_int,
    pub no_samples: ::std::os::raw::c_int,
    pub timecode: i64,
    pub p_data: *mut f32,
}
#[test]
fn bindgen_test_layout_NDIlib_audio_frame_interleaved_32f_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_audio_frame_interleaved_32f_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_audio_frame_interleaved_32f_t>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(NDIlib_audio_frame_interleaved_32f_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_audio_frame_interleaved_32f_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(NDIlib_audio_frame_interleaved_32f_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32f_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32f_t),
            "::",
            stringify!(no_channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32f_t),
            "::",
            stringify!(no_samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32f_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_interleaved_32f_t),
            "::",
            stringify!(p_data)
        )
    );
}
extern "C" {
    pub fn NDIlib_util_send_send_audio_interleaved_16s(
        p_instance: NDIlib_send_instance_t,
        p_audio_data: *const NDIlib_audio_frame_interleaved_16s_t,
    );
}
extern "C" {
    pub fn NDIlib_util_send_send_audio_interleaved_32s(
        p_instance: NDIlib_send_instance_t,
        p_audio_data: *const NDIlib_audio_frame_interleaved_32s_t,
    );
}
extern "C" {
    pub fn NDIlib_util_send_send_audio_interleaved_32f(
        p_instance: NDIlib_send_instance_t,
        p_audio_data: *const NDIlib_audio_frame_interleaved_32f_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_to_interleaved_16s_v2(
        p_src: *const NDIlib_audio_frame_v2_t,
        p_dst: *mut NDIlib_audio_frame_interleaved_16s_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_from_interleaved_16s_v2(
        p_src: *const NDIlib_audio_frame_interleaved_16s_t,
        p_dst: *mut NDIlib_audio_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_to_interleaved_32s_v2(
        p_src: *const NDIlib_audio_frame_v2_t,
        p_dst: *mut NDIlib_audio_frame_interleaved_32s_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_from_interleaved_32s_v2(
        p_src: *const NDIlib_audio_frame_interleaved_32s_t,
        p_dst: *mut NDIlib_audio_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_to_interleaved_32f_v2(
        p_src: *const NDIlib_audio_frame_v2_t,
        p_dst: *mut NDIlib_audio_frame_interleaved_32f_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_from_interleaved_32f_v2(
        p_src: *const NDIlib_audio_frame_interleaved_32f_t,
        p_dst: *mut NDIlib_audio_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_util_V210_to_P216(
        p_src_v210: *const NDIlib_video_frame_v2_t,
        p_dst_p216: *mut NDIlib_video_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_util_P216_to_V210(
        p_src_p216: *const NDIlib_video_frame_v2_t,
        p_dst_v210: *mut NDIlib_video_frame_v2_t,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_video_frame_t {
    pub xres: ::std::os::raw::c_int,
    pub yres: ::std::os::raw::c_int,
    pub FourCC: NDIlib_FourCC_video_type_e,
    pub frame_rate_N: ::std::os::raw::c_int,
    pub frame_rate_D: ::std::os::raw::c_int,
    pub picture_aspect_ratio: f32,
    pub frame_format_type: NDIlib_frame_format_type_e,
    pub timecode: i64,
    pub p_data: *mut u8,
    pub line_stride_in_bytes: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NDIlib_video_frame_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_video_frame_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_video_frame_t>(),
        56usize,
        concat!("Size of: ", stringify!(NDIlib_video_frame_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_video_frame_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_video_frame_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xres) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(xres)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yres) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(yres)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FourCC) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(FourCC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_rate_N) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(frame_rate_N)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_rate_D) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(frame_rate_D)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).picture_aspect_ratio) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(picture_aspect_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_format_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(frame_format_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(p_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line_stride_in_bytes) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_video_frame_t),
            "::",
            stringify!(line_stride_in_bytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_audio_frame_t {
    pub sample_rate: ::std::os::raw::c_int,
    pub no_channels: ::std::os::raw::c_int,
    pub no_samples: ::std::os::raw::c_int,
    pub timecode: i64,
    pub p_data: *mut f32,
    pub channel_stride_in_bytes: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NDIlib_audio_frame_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_audio_frame_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_audio_frame_t>(),
        40usize,
        concat!("Size of: ", stringify!(NDIlib_audio_frame_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_audio_frame_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_audio_frame_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_channels) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_t),
            "::",
            stringify!(no_channels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_samples) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_t),
            "::",
            stringify!(no_samples)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timecode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_t),
            "::",
            stringify!(timecode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_t),
            "::",
            stringify!(p_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_stride_in_bytes) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_audio_frame_t),
            "::",
            stringify!(channel_stride_in_bytes)
        )
    );
}
extern "C" {
    pub fn NDIlib_find_create2(
        p_create_settings: *const NDIlib_find_create_t,
    ) -> NDIlib_find_instance_t;
}
extern "C" {
    pub fn NDIlib_find_create(
        p_create_settings: *const NDIlib_find_create_t,
    ) -> NDIlib_find_instance_t;
}
extern "C" {
    pub fn NDIlib_find_get_sources(
        p_instance: NDIlib_find_instance_t,
        p_no_sources: *mut u32,
        timeout_in_ms: u32,
    ) -> *const NDIlib_source_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NDIlib_recv_create_t {
    pub source_to_connect_to: NDIlib_source_t,
    pub color_format: NDIlib_recv_color_format_e,
    pub bandwidth: NDIlib_recv_bandwidth_e,
    pub allow_video_fields: bool,
}
#[test]
fn bindgen_test_layout_NDIlib_recv_create_t() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_recv_create_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_recv_create_t>(),
        32usize,
        concat!("Size of: ", stringify!(NDIlib_recv_create_t))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_recv_create_t>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_recv_create_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).source_to_connect_to) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_t),
            "::",
            stringify!(source_to_connect_to)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_format) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_t),
            "::",
            stringify!(color_format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bandwidth) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_t),
            "::",
            stringify!(bandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allow_video_fields) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_recv_create_t),
            "::",
            stringify!(allow_video_fields)
        )
    );
}
extern "C" {
    pub fn NDIlib_recv_create_v2(
        p_create_settings: *const NDIlib_recv_create_t,
    ) -> NDIlib_recv_instance_t;
}
extern "C" {
    pub fn NDIlib_recv_create2(
        p_create_settings: *const NDIlib_recv_create_t,
    ) -> NDIlib_recv_instance_t;
}
extern "C" {
    pub fn NDIlib_recv_create(
        p_create_settings: *const NDIlib_recv_create_t,
    ) -> NDIlib_recv_instance_t;
}
extern "C" {
    pub fn NDIlib_recv_capture(
        p_instance: NDIlib_recv_instance_t,
        p_video_data: *mut NDIlib_video_frame_t,
        p_audio_data: *mut NDIlib_audio_frame_t,
        p_metadata: *mut NDIlib_metadata_frame_t,
        timeout_in_ms: u32,
    ) -> NDIlib_frame_type_e;
}
extern "C" {
    pub fn NDIlib_recv_free_video(
        p_instance: NDIlib_recv_instance_t,
        p_video_data: *const NDIlib_video_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_recv_free_audio(
        p_instance: NDIlib_recv_instance_t,
        p_audio_data: *const NDIlib_audio_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_send_send_video(
        p_instance: NDIlib_send_instance_t,
        p_video_data: *const NDIlib_video_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_send_send_video_async(
        p_instance: NDIlib_send_instance_t,
        p_video_data: *const NDIlib_video_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_send_send_audio(
        p_instance: NDIlib_send_instance_t,
        p_audio_data: *const NDIlib_audio_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_to_interleaved_16s(
        p_src: *const NDIlib_audio_frame_t,
        p_dst: *mut NDIlib_audio_frame_interleaved_16s_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_from_interleaved_16s(
        p_src: *const NDIlib_audio_frame_interleaved_16s_t,
        p_dst: *mut NDIlib_audio_frame_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_to_interleaved_32f(
        p_src: *const NDIlib_audio_frame_t,
        p_dst: *mut NDIlib_audio_frame_interleaved_32f_t,
    );
}
extern "C" {
    pub fn NDIlib_util_audio_from_interleaved_32f(
        p_src: *const NDIlib_audio_frame_interleaved_32f_t,
        p_dst: *mut NDIlib_audio_frame_t,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDIlib_framesync_instance_type {
    _unused: [u8; 0],
}
pub type NDIlib_framesync_instance_t = *mut NDIlib_framesync_instance_type;
extern "C" {
    pub fn NDIlib_framesync_create(
        p_receiver: NDIlib_recv_instance_t,
    ) -> NDIlib_framesync_instance_t;
}
extern "C" {
    pub fn NDIlib_framesync_destroy(p_instance: NDIlib_framesync_instance_t);
}
extern "C" {
    pub fn NDIlib_framesync_capture_audio(
        p_instance: NDIlib_framesync_instance_t,
        p_audio_data: *mut NDIlib_audio_frame_v2_t,
        sample_rate: ::std::os::raw::c_int,
        no_channels: ::std::os::raw::c_int,
        no_samples: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn NDIlib_framesync_capture_audio_v2(
        p_instance: NDIlib_framesync_instance_t,
        p_audio_data: *mut NDIlib_audio_frame_v3_t,
        sample_rate: ::std::os::raw::c_int,
        no_channels: ::std::os::raw::c_int,
        no_samples: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn NDIlib_framesync_free_audio(
        p_instance: NDIlib_framesync_instance_t,
        p_audio_data: *mut NDIlib_audio_frame_v2_t,
    );
}
extern "C" {
    pub fn NDIlib_framesync_free_audio_v2(
        p_instance: NDIlib_framesync_instance_t,
        p_audio_data: *mut NDIlib_audio_frame_v3_t,
    );
}
extern "C" {
    pub fn NDIlib_framesync_audio_queue_depth(
        p_instance: NDIlib_framesync_instance_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn NDIlib_framesync_capture_video(
        p_instance: NDIlib_framesync_instance_t,
        p_video_data: *mut NDIlib_video_frame_v2_t,
        field_type: NDIlib_frame_format_type_e,
    );
}
extern "C" {
    pub fn NDIlib_framesync_free_video(
        p_instance: NDIlib_framesync_instance_t,
        p_video_data: *mut NDIlib_video_frame_v2_t,
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NDIlib_v5 {
    pub __bindgen_anon_1: NDIlib_v5__bindgen_ty_1,
    pub __bindgen_anon_2: NDIlib_v5__bindgen_ty_2,
    pub __bindgen_anon_3: NDIlib_v5__bindgen_ty_3,
    pub __bindgen_anon_4: NDIlib_v5__bindgen_ty_4,
    pub __bindgen_anon_5: NDIlib_v5__bindgen_ty_5,
    pub __bindgen_anon_6: NDIlib_v5__bindgen_ty_6,
    pub __bindgen_anon_7: NDIlib_v5__bindgen_ty_7,
    pub __bindgen_anon_8: NDIlib_v5__bindgen_ty_8,
    pub __bindgen_anon_9: NDIlib_v5__bindgen_ty_9,
    pub __bindgen_anon_10: NDIlib_v5__bindgen_ty_10,
    pub __bindgen_anon_11: NDIlib_v5__bindgen_ty_11,
    pub __bindgen_anon_12: NDIlib_v5__bindgen_ty_12,
    pub __bindgen_anon_13: NDIlib_v5__bindgen_ty_13,
    pub __bindgen_anon_14: NDIlib_v5__bindgen_ty_14,
    pub __bindgen_anon_15: NDIlib_v5__bindgen_ty_15,
    pub __bindgen_anon_16: NDIlib_v5__bindgen_ty_16,
    pub __bindgen_anon_17: NDIlib_v5__bindgen_ty_17,
    pub __bindgen_anon_18: NDIlib_v5__bindgen_ty_18,
    pub __bindgen_anon_19: NDIlib_v5__bindgen_ty_19,
    pub __bindgen_anon_20: NDIlib_v5__bindgen_ty_20,
    pub __bindgen_anon_21: NDIlib_v5__bindgen_ty_21,
    pub __bindgen_anon_22: NDIlib_v5__bindgen_ty_22,
    pub __bindgen_anon_23: NDIlib_v5__bindgen_ty_23,
    pub __bindgen_anon_24: NDIlib_v5__bindgen_ty_24,
    pub __bindgen_anon_25: NDIlib_v5__bindgen_ty_25,
    pub __bindgen_anon_26: NDIlib_v5__bindgen_ty_26,
    pub __bindgen_anon_27: NDIlib_v5__bindgen_ty_27,
    pub __bindgen_anon_28: NDIlib_v5__bindgen_ty_28,
    pub __bindgen_anon_29: NDIlib_v5__bindgen_ty_29,
    pub __bindgen_anon_30: NDIlib_v5__bindgen_ty_30,
    pub __bindgen_anon_31: NDIlib_v5__bindgen_ty_31,
    pub __bindgen_anon_32: NDIlib_v5__bindgen_ty_32,
    pub __bindgen_anon_33: NDIlib_v5__bindgen_ty_33,
    pub __bindgen_anon_34: NDIlib_v5__bindgen_ty_34,
    pub __bindgen_anon_35: NDIlib_v5__bindgen_ty_35,
    pub __bindgen_anon_36: NDIlib_v5__bindgen_ty_36,
    pub __bindgen_anon_37: NDIlib_v5__bindgen_ty_37,
    pub __bindgen_anon_38: NDIlib_v5__bindgen_ty_38,
    pub __bindgen_anon_39: NDIlib_v5__bindgen_ty_39,
    pub __bindgen_anon_40: NDIlib_v5__bindgen_ty_40,
    pub __bindgen_anon_41: NDIlib_v5__bindgen_ty_41,
    pub __bindgen_anon_42: NDIlib_v5__bindgen_ty_42,
    pub __bindgen_anon_43: NDIlib_v5__bindgen_ty_43,
    pub __bindgen_anon_44: NDIlib_v5__bindgen_ty_44,
    pub __bindgen_anon_45: NDIlib_v5__bindgen_ty_45,
    pub __bindgen_anon_46: NDIlib_v5__bindgen_ty_46,
    pub __bindgen_anon_47: NDIlib_v5__bindgen_ty_47,
    pub __bindgen_anon_48: NDIlib_v5__bindgen_ty_48,
    pub __bindgen_anon_49: NDIlib_v5__bindgen_ty_49,
    pub __bindgen_anon_50: NDIlib_v5__bindgen_ty_50,
    pub __bindgen_anon_51: NDIlib_v5__bindgen_ty_51,
    pub __bindgen_anon_52: NDIlib_v5__bindgen_ty_52,
    pub __bindgen_anon_53: NDIlib_v5__bindgen_ty_53,
    pub __bindgen_anon_54: NDIlib_v5__bindgen_ty_54,
    pub __bindgen_anon_55: NDIlib_v5__bindgen_ty_55,
    pub __bindgen_anon_56: NDIlib_v5__bindgen_ty_56,
    pub __bindgen_anon_57: NDIlib_v5__bindgen_ty_57,
    pub __bindgen_anon_58: NDIlib_v5__bindgen_ty_58,
    pub __bindgen_anon_59: NDIlib_v5__bindgen_ty_59,
    pub __bindgen_anon_60: NDIlib_v5__bindgen_ty_60,
    pub __bindgen_anon_61: NDIlib_v5__bindgen_ty_61,
    pub __bindgen_anon_62: NDIlib_v5__bindgen_ty_62,
    pub __bindgen_anon_63: NDIlib_v5__bindgen_ty_63,
    pub __bindgen_anon_64: NDIlib_v5__bindgen_ty_64,
    pub __bindgen_anon_65: NDIlib_v5__bindgen_ty_65,
    pub __bindgen_anon_66: NDIlib_v5__bindgen_ty_66,
    pub __bindgen_anon_67: NDIlib_v5__bindgen_ty_67,
    pub __bindgen_anon_68: NDIlib_v5__bindgen_ty_68,
    pub __bindgen_anon_69: NDIlib_v5__bindgen_ty_69,
    pub __bindgen_anon_70: NDIlib_v5__bindgen_ty_70,
    pub __bindgen_anon_71: NDIlib_v5__bindgen_ty_71,
    pub __bindgen_anon_72: NDIlib_v5__bindgen_ty_72,
    pub __bindgen_anon_73: NDIlib_v5__bindgen_ty_73,
    pub __bindgen_anon_74: NDIlib_v5__bindgen_ty_74,
    pub __bindgen_anon_75: NDIlib_v5__bindgen_ty_75,
    pub __bindgen_anon_76: NDIlib_v5__bindgen_ty_76,
    pub __bindgen_anon_77: NDIlib_v5__bindgen_ty_77,
    pub __bindgen_anon_78: NDIlib_v5__bindgen_ty_78,
    pub __bindgen_anon_79: NDIlib_v5__bindgen_ty_79,
    pub __bindgen_anon_80: NDIlib_v5__bindgen_ty_80,
    pub __bindgen_anon_81: NDIlib_v5__bindgen_ty_81,
    pub __bindgen_anon_82: NDIlib_v5__bindgen_ty_82,
    pub __bindgen_anon_83: NDIlib_v5__bindgen_ty_83,
    pub __bindgen_anon_84: NDIlib_v5__bindgen_ty_84,
    pub __bindgen_anon_85: NDIlib_v5__bindgen_ty_85,
    pub __bindgen_anon_86: NDIlib_v5__bindgen_ty_86,
    pub __bindgen_anon_87: NDIlib_v5__bindgen_ty_87,
    pub __bindgen_anon_88: NDIlib_v5__bindgen_ty_88,
    pub __bindgen_anon_89: NDIlib_v5__bindgen_ty_89,
    pub __bindgen_anon_90: NDIlib_v5__bindgen_ty_90,
    pub __bindgen_anon_91: NDIlib_v5__bindgen_ty_91,
    pub __bindgen_anon_92: NDIlib_v5__bindgen_ty_92,
    pub __bindgen_anon_93: NDIlib_v5__bindgen_ty_93,
    pub __bindgen_anon_94: NDIlib_v5__bindgen_ty_94,
    pub __bindgen_anon_95: NDIlib_v5__bindgen_ty_95,
    pub __bindgen_anon_96: NDIlib_v5__bindgen_ty_96,
    pub __bindgen_anon_97: NDIlib_v5__bindgen_ty_97,
    pub __bindgen_anon_98: NDIlib_v5__bindgen_ty_98,
    pub __bindgen_anon_99: NDIlib_v5__bindgen_ty_99,
    pub __bindgen_anon_100: NDIlib_v5__bindgen_ty_100,
    pub __bindgen_anon_101: NDIlib_v5__bindgen_ty_101,
    pub __bindgen_anon_102: NDIlib_v5__bindgen_ty_102,
    pub __bindgen_anon_103: NDIlib_v5__bindgen_ty_103,
    pub __bindgen_anon_104: NDIlib_v5__bindgen_ty_104,
    pub __bindgen_anon_105: NDIlib_v5__bindgen_ty_105,
    pub __bindgen_anon_106: NDIlib_v5__bindgen_ty_106,
    pub __bindgen_anon_107: NDIlib_v5__bindgen_ty_107,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_1 {
    pub initialize: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub NDIlib_initialize: ::std::option::Option<unsafe extern "C" fn() -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_1),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_initialize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_1),
            "::",
            stringify!(NDIlib_initialize)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_2 {
    pub destroy: ::std::option::Option<unsafe extern "C" fn()>,
    pub NDIlib_destroy: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_2),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_2),
            "::",
            stringify!(NDIlib_destroy)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_3 {
    pub version: ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>,
    pub NDIlib_version:
        ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_3),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_3),
            "::",
            stringify!(NDIlib_version)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_4 {
    pub is_supported_CPU: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub NDIlib_is_supported_CPU: ::std::option::Option<unsafe extern "C" fn() -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_4> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_supported_CPU) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_4),
            "::",
            stringify!(is_supported_CPU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_is_supported_CPU) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_4),
            "::",
            stringify!(NDIlib_is_supported_CPU)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_5 {
    pub find_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_find_create_t,
        ) -> NDIlib_find_instance_t,
    >,
    pub NDIlib_find_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_find_create_t,
        ) -> NDIlib_find_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_5> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_5>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_5))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).find_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_5),
            "::",
            stringify!(find_create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_find_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_5),
            "::",
            stringify!(NDIlib_find_create)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_6 {
    pub find_create_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_find_create_t,
        ) -> NDIlib_find_instance_t,
    >,
    pub NDIlib_find_create_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_find_create_t,
        ) -> NDIlib_find_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_6> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_6>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).find_create_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_6),
            "::",
            stringify!(find_create_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_find_create_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_6),
            "::",
            stringify!(NDIlib_find_create_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_7 {
    pub find_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_find_instance_t)>,
    pub NDIlib_find_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_find_instance_t)>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_7() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_7> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_7>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_7>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_7))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).find_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_7),
            "::",
            stringify!(find_destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_find_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_7),
            "::",
            stringify!(NDIlib_find_destroy)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_8 {
    pub find_get_sources: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_find_instance_t,
            p_no_sources: *mut u32,
            timeout_in_ms: u32,
        ) -> *const NDIlib_source_t,
    >,
    pub NDIlib_find_get_sources: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_find_instance_t,
            p_no_sources: *mut u32,
            timeout_in_ms: u32,
        ) -> *const NDIlib_source_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_8() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_8> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_8>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_8>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_8))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).find_get_sources) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_8),
            "::",
            stringify!(find_get_sources)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_find_get_sources) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_8),
            "::",
            stringify!(NDIlib_find_get_sources)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_9 {
    pub send_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_send_create_t,
        ) -> NDIlib_send_instance_t,
    >,
    pub NDIlib_send_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_send_create_t,
        ) -> NDIlib_send_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_9() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_9> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_9>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_9>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_9))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_9),
            "::",
            stringify!(send_create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_9),
            "::",
            stringify!(NDIlib_send_create)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_10 {
    pub send_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_send_instance_t)>,
    pub NDIlib_send_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_send_instance_t)>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_10() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_10> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_10>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_10>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_10))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_10),
            "::",
            stringify!(send_destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_10),
            "::",
            stringify!(NDIlib_send_destroy)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_11 {
    pub send_send_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_t,
        ),
    >,
    pub NDIlib_send_send_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_11() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_11> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_11>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_11))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_11>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_11))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_video) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_11),
            "::",
            stringify!(send_send_video)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_send_video) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_11),
            "::",
            stringify!(NDIlib_send_send_video)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_12 {
    pub send_send_video_async: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_t,
        ),
    >,
    pub NDIlib_send_send_video_async: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_12() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_12> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_12>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_12))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_12>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_12))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_video_async) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_12),
            "::",
            stringify!(send_send_video_async)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_send_send_video_async) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_12),
            "::",
            stringify!(NDIlib_send_send_video_async)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_13 {
    pub send_send_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_t,
        ),
    >,
    pub NDIlib_send_send_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_13() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_13> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_13>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_13))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_13>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_13))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_audio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_13),
            "::",
            stringify!(send_send_audio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_send_audio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_13),
            "::",
            stringify!(NDIlib_send_send_audio)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_14 {
    pub send_send_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
    pub NDIlib_send_send_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_14() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_14> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_14>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_14))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_14>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_14))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_14),
            "::",
            stringify!(send_send_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_send_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_14),
            "::",
            stringify!(NDIlib_send_send_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_15 {
    pub send_capture: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
    pub NDIlib_send_capture: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_15() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_15> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_15>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_15))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_15>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_15))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_capture) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_15),
            "::",
            stringify!(send_capture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_capture) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_15),
            "::",
            stringify!(NDIlib_send_capture)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_16 {
    pub send_free_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
    pub NDIlib_send_free_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_16() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_16> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_16>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_16))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_16>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_16))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_free_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_16),
            "::",
            stringify!(send_free_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_free_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_16),
            "::",
            stringify!(NDIlib_send_free_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_17 {
    pub send_get_tally: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_tally: *mut NDIlib_tally_t,
            timeout_in_ms: u32,
        ) -> bool,
    >,
    pub NDIlib_send_get_tally: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_tally: *mut NDIlib_tally_t,
            timeout_in_ms: u32,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_17() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_17> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_17>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_17))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_17>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_17))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_get_tally) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_17),
            "::",
            stringify!(send_get_tally)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_get_tally) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_17),
            "::",
            stringify!(NDIlib_send_get_tally)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_18 {
    pub send_get_no_connections: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            timeout_in_ms: u32,
        ) -> ::std::os::raw::c_int,
    >,
    pub NDIlib_send_get_no_connections: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            timeout_in_ms: u32,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_18() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_18> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_18>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_18))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_18>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_18))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_get_no_connections) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_18),
            "::",
            stringify!(send_get_no_connections)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_send_get_no_connections) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_18),
            "::",
            stringify!(NDIlib_send_get_no_connections)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_19 {
    pub send_clear_connection_metadata:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_send_instance_t)>,
    pub NDIlib_send_clear_connection_metadata:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_send_instance_t)>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_19() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_19> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_19>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_19))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_19>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_19))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).send_clear_connection_metadata) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_19),
            "::",
            stringify!(send_clear_connection_metadata)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_send_clear_connection_metadata) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_19),
            "::",
            stringify!(NDIlib_send_clear_connection_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_20 {
    pub send_add_connection_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
    pub NDIlib_send_add_connection_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_20() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_20> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_20>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_20))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_20>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_20))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).send_add_connection_metadata) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_20),
            "::",
            stringify!(send_add_connection_metadata)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_send_add_connection_metadata) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_20),
            "::",
            stringify!(NDIlib_send_add_connection_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_21 {
    pub send_set_failover: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_failover_source: *const NDIlib_source_t,
        ),
    >,
    pub NDIlib_send_set_failover: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_failover_source: *const NDIlib_source_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_21() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_21> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_21>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_21))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_21>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_21))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_set_failover) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_21),
            "::",
            stringify!(send_set_failover)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_set_failover) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_21),
            "::",
            stringify!(NDIlib_send_set_failover)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_22 {
    pub recv_create_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_recv_create_t,
        ) -> NDIlib_recv_instance_t,
    >,
    pub NDIlib_recv_create_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_recv_create_t,
        ) -> NDIlib_recv_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_22() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_22> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_22>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_22))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_22>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_22))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_create_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_22),
            "::",
            stringify!(recv_create_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_create_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_22),
            "::",
            stringify!(NDIlib_recv_create_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_23 {
    pub recv_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_recv_create_t,
        ) -> NDIlib_recv_instance_t,
    >,
    pub NDIlib_recv_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_recv_create_t,
        ) -> NDIlib_recv_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_23() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_23> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_23>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_23))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_23>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_23))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_23),
            "::",
            stringify!(recv_create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_23),
            "::",
            stringify!(NDIlib_recv_create)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_24 {
    pub recv_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t)>,
    pub NDIlib_recv_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t)>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_24() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_24> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_24>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_24))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_24>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_24))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_24),
            "::",
            stringify!(recv_destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_24),
            "::",
            stringify!(NDIlib_recv_destroy)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_25 {
    pub recv_capture: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *mut NDIlib_video_frame_t,
            p_audio_data: *mut NDIlib_audio_frame_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
    pub NDIlib_recv_capture: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *mut NDIlib_video_frame_t,
            p_audio_data: *mut NDIlib_audio_frame_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_25() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_25> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_25>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_25))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_25>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_25))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_capture) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_25),
            "::",
            stringify!(recv_capture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_capture) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_25),
            "::",
            stringify!(NDIlib_recv_capture)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_26 {
    pub recv_free_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *const NDIlib_video_frame_t,
        ),
    >,
    pub NDIlib_recv_free_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *const NDIlib_video_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_26() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_26> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_26>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_26))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_26>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_26))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_free_video) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_26),
            "::",
            stringify!(recv_free_video)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_free_video) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_26),
            "::",
            stringify!(NDIlib_recv_free_video)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_27 {
    pub recv_free_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_audio_data: *const NDIlib_audio_frame_t,
        ),
    >,
    pub NDIlib_recv_free_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_audio_data: *const NDIlib_audio_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_27() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_27> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_27>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_27))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_27>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_27))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_free_audio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_27),
            "::",
            stringify!(recv_free_audio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_free_audio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_27),
            "::",
            stringify!(NDIlib_recv_free_audio)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_28 {
    pub recv_free_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
    pub NDIlib_recv_free_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_28() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_28> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_28>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_28))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_28>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_28))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_free_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_28),
            "::",
            stringify!(recv_free_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_free_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_28),
            "::",
            stringify!(NDIlib_recv_free_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_29 {
    pub recv_send_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ) -> bool,
    >,
    pub NDIlib_recv_send_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_29() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_29> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_29>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_29))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_29>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_29))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_send_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_29),
            "::",
            stringify!(recv_send_metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_send_metadata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_29),
            "::",
            stringify!(NDIlib_recv_send_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_30 {
    pub recv_set_tally: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_tally: *const NDIlib_tally_t,
        ) -> bool,
    >,
    pub NDIlib_recv_set_tally: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_tally: *const NDIlib_tally_t,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_30() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_30> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_30>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_30))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_30>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_30))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_set_tally) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_30),
            "::",
            stringify!(recv_set_tally)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_set_tally) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_30),
            "::",
            stringify!(NDIlib_recv_set_tally)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_31 {
    pub recv_get_performance: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_total: *mut NDIlib_recv_performance_t,
            p_dropped: *mut NDIlib_recv_performance_t,
        ),
    >,
    pub NDIlib_recv_get_performance: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_total: *mut NDIlib_recv_performance_t,
            p_dropped: *mut NDIlib_recv_performance_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_31() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_31> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_31>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_31))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_31>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_31))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_get_performance) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_31),
            "::",
            stringify!(recv_get_performance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_get_performance) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_31),
            "::",
            stringify!(NDIlib_recv_get_performance)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_32 {
    pub recv_get_queue: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, p_total: *mut NDIlib_recv_queue_t),
    >,
    pub NDIlib_recv_get_queue: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, p_total: *mut NDIlib_recv_queue_t),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_32() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_32> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_32>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_32))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_32>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_32))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_get_queue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_32),
            "::",
            stringify!(recv_get_queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_get_queue) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_32),
            "::",
            stringify!(NDIlib_recv_get_queue)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_33 {
    pub recv_clear_connection_metadata:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t)>,
    pub NDIlib_recv_clear_connection_metadata:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t)>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_33() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_33> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_33>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_33))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_33>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_33))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recv_clear_connection_metadata) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_33),
            "::",
            stringify!(recv_clear_connection_metadata)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_clear_connection_metadata) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_33),
            "::",
            stringify!(NDIlib_recv_clear_connection_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_34 {
    pub recv_add_connection_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
    pub NDIlib_recv_add_connection_metadata: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_metadata: *const NDIlib_metadata_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_34() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_34> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_34>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_34))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_34>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_34))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recv_add_connection_metadata) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_34),
            "::",
            stringify!(recv_add_connection_metadata)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_add_connection_metadata) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_34),
            "::",
            stringify!(NDIlib_recv_add_connection_metadata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_35 {
    pub recv_get_no_connections: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> ::std::os::raw::c_int,
    >,
    pub NDIlib_recv_get_no_connections: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_35() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_35> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_35>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_35))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_35>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_35))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_get_no_connections) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_35),
            "::",
            stringify!(recv_get_no_connections)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_get_no_connections) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_35),
            "::",
            stringify!(NDIlib_recv_get_no_connections)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_36 {
    pub routing_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_routing_create_t,
        ) -> NDIlib_routing_instance_t,
    >,
    pub NDIlib_routing_create: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_routing_create_t,
        ) -> NDIlib_routing_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_36() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_36> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_36>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_36))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_36>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_36))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).routing_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_36),
            "::",
            stringify!(routing_create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_routing_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_36),
            "::",
            stringify!(NDIlib_routing_create)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_37 {
    pub routing_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_routing_instance_t)>,
    pub NDIlib_routing_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_routing_instance_t)>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_37() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_37> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_37>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_37))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_37>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_37))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).routing_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_37),
            "::",
            stringify!(routing_destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_routing_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_37),
            "::",
            stringify!(NDIlib_routing_destroy)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_38 {
    pub routing_change: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_routing_instance_t,
            p_source: *const NDIlib_source_t,
        ) -> bool,
    >,
    pub NDIlib_routing_change: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_routing_instance_t,
            p_source: *const NDIlib_source_t,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_38() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_38> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_38>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_38))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_38>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_38))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).routing_change) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_38),
            "::",
            stringify!(routing_change)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_routing_change) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_38),
            "::",
            stringify!(NDIlib_routing_change)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_39 {
    pub routing_clear:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_routing_instance_t) -> bool>,
    pub NDIlib_routing_clear:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_routing_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_39() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_39> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_39>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_39))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_39>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_39))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).routing_clear) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_39),
            "::",
            stringify!(routing_clear)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_routing_clear) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_39),
            "::",
            stringify!(NDIlib_routing_clear)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_40 {
    pub util_send_send_audio_interleaved_16s: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_interleaved_16s_t,
        ),
    >,
    pub NDIlib_util_send_send_audio_interleaved_16s: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_interleaved_16s_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_40() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_40> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_40>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_40))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_40>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_40))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_send_send_audio_interleaved_16s) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_40),
            "::",
            stringify!(util_send_send_audio_interleaved_16s)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_send_send_audio_interleaved_16s) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_40),
            "::",
            stringify!(NDIlib_util_send_send_audio_interleaved_16s)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_41 {
    pub util_audio_to_interleaved_16s: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_16s_t,
        ),
    >,
    pub NDIlib_util_audio_to_interleaved_16s: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_16s_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_41() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_41> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_41>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_41))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_41>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_41))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_to_interleaved_16s) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_41),
            "::",
            stringify!(util_audio_to_interleaved_16s)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_to_interleaved_16s) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_41),
            "::",
            stringify!(NDIlib_util_audio_to_interleaved_16s)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_42 {
    pub util_audio_from_interleaved_16s: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_16s_t,
            p_dst: *mut NDIlib_audio_frame_t,
        ),
    >,
    pub NDIlib_util_audio_from_interleaved_16s: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_16s_t,
            p_dst: *mut NDIlib_audio_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_42() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_42> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_42>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_42))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_42>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_42))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_from_interleaved_16s) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_42),
            "::",
            stringify!(util_audio_from_interleaved_16s)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_from_interleaved_16s) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_42),
            "::",
            stringify!(NDIlib_util_audio_from_interleaved_16s)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_43 {
    pub find_wait_for_sources: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_find_instance_t, timeout_in_ms: u32) -> bool,
    >,
    pub NDIlib_find_wait_for_sources: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_find_instance_t, timeout_in_ms: u32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_43() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_43> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_43>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_43))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_43>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_43))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).find_wait_for_sources) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_43),
            "::",
            stringify!(find_wait_for_sources)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_find_wait_for_sources) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_43),
            "::",
            stringify!(NDIlib_find_wait_for_sources)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_44 {
    pub find_get_current_sources: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_find_instance_t,
            p_no_sources: *mut u32,
        ) -> *const NDIlib_source_t,
    >,
    pub NDIlib_find_get_current_sources: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_find_instance_t,
            p_no_sources: *mut u32,
        ) -> *const NDIlib_source_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_44() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_44> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_44>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_44))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_44>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_44))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).find_get_current_sources) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_44),
            "::",
            stringify!(find_get_current_sources)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_find_get_current_sources) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_44),
            "::",
            stringify!(NDIlib_find_get_current_sources)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_45 {
    pub util_audio_to_interleaved_32f: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_32f_t,
        ),
    >,
    pub NDIlib_util_audio_to_interleaved_32f: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_32f_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_45() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_45> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_45>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_45))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_45>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_45))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_to_interleaved_32f) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_45),
            "::",
            stringify!(util_audio_to_interleaved_32f)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_to_interleaved_32f) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_45),
            "::",
            stringify!(NDIlib_util_audio_to_interleaved_32f)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_46 {
    pub util_audio_from_interleaved_32f: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_32f_t,
            p_dst: *mut NDIlib_audio_frame_t,
        ),
    >,
    pub NDIlib_util_audio_from_interleaved_32f: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_32f_t,
            p_dst: *mut NDIlib_audio_frame_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_46() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_46> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_46>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_46))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_46>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_46))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_from_interleaved_32f) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_46),
            "::",
            stringify!(util_audio_from_interleaved_32f)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_from_interleaved_32f) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_46),
            "::",
            stringify!(NDIlib_util_audio_from_interleaved_32f)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_47 {
    pub util_send_send_audio_interleaved_32f: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_interleaved_32f_t,
        ),
    >,
    pub NDIlib_util_send_send_audio_interleaved_32f: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_interleaved_32f_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_47() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_47> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_47>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_47))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_47>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_47))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_send_send_audio_interleaved_32f) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_47),
            "::",
            stringify!(util_send_send_audio_interleaved_32f)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_send_send_audio_interleaved_32f) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_47),
            "::",
            stringify!(NDIlib_util_send_send_audio_interleaved_32f)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_48 {
    pub recv_free_video_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *const NDIlib_video_frame_v2_t,
        ),
    >,
    pub NDIlib_recv_free_video_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *const NDIlib_video_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_48() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_48> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_48>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_48))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_48>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_48))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_free_video_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_48),
            "::",
            stringify!(recv_free_video_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_free_video_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_48),
            "::",
            stringify!(NDIlib_recv_free_video_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_49 {
    pub recv_free_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v2_t,
        ),
    >,
    pub NDIlib_recv_free_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_49() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_49> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_49>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_49))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_49>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_49))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_free_audio_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_49),
            "::",
            stringify!(recv_free_audio_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_free_audio_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_49),
            "::",
            stringify!(NDIlib_recv_free_audio_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_50 {
    pub recv_capture_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
            p_audio_data: *mut NDIlib_audio_frame_v2_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
    pub NDIlib_recv_capture_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
            p_audio_data: *mut NDIlib_audio_frame_v2_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_50() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_50> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_50>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_50))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_50>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_50))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_capture_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_50),
            "::",
            stringify!(recv_capture_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_capture_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_50),
            "::",
            stringify!(NDIlib_recv_capture_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_51 {
    pub send_send_video_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_v2_t,
        ),
    >,
    pub NDIlib_send_send_video_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_51() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_51> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_51>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_51))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_51>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_51))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_video_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_51),
            "::",
            stringify!(send_send_video_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_send_video_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_51),
            "::",
            stringify!(NDIlib_send_send_video_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_52 {
    pub send_send_video_async_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_v2_t,
        ),
    >,
    pub NDIlib_send_send_video_async_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_video_data: *const NDIlib_video_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_52() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_52> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_52>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_52))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_52>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_52))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_video_async_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_52),
            "::",
            stringify!(send_send_video_async_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_send_send_video_async_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_52),
            "::",
            stringify!(NDIlib_send_send_video_async_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_53 {
    pub send_send_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v2_t,
        ),
    >,
    pub NDIlib_send_send_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_53() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_53> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_53>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_53))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_53>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_53))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_audio_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_53),
            "::",
            stringify!(send_send_audio_v2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_send_audio_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_53),
            "::",
            stringify!(NDIlib_send_send_audio_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_54 {
    pub util_audio_to_interleaved_16s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_v2_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_16s_t,
        ),
    >,
    pub NDIlib_util_audio_to_interleaved_16s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_v2_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_16s_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_54() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_54> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_54>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_54))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_54>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_54))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_to_interleaved_16s_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_54),
            "::",
            stringify!(util_audio_to_interleaved_16s_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_to_interleaved_16s_v2) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_54),
            "::",
            stringify!(NDIlib_util_audio_to_interleaved_16s_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_55 {
    pub util_audio_from_interleaved_16s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_16s_t,
            p_dst: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
    pub NDIlib_util_audio_from_interleaved_16s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_16s_t,
            p_dst: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_55() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_55> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_55>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_55))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_55>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_55))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_from_interleaved_16s_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_55),
            "::",
            stringify!(util_audio_from_interleaved_16s_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_from_interleaved_16s_v2) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_55),
            "::",
            stringify!(NDIlib_util_audio_from_interleaved_16s_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_56 {
    pub util_audio_to_interleaved_32f_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_v2_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_32f_t,
        ),
    >,
    pub NDIlib_util_audio_to_interleaved_32f_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_v2_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_32f_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_56() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_56> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_56>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_56))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_56>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_56))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_to_interleaved_32f_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_56),
            "::",
            stringify!(util_audio_to_interleaved_32f_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_to_interleaved_32f_v2) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_56),
            "::",
            stringify!(NDIlib_util_audio_to_interleaved_32f_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_57 {
    pub util_audio_from_interleaved_32f_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_32f_t,
            p_dst: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
    pub NDIlib_util_audio_from_interleaved_32f_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_32f_t,
            p_dst: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_57() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_57> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_57>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_57))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_57>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_57))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_from_interleaved_32f_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_57),
            "::",
            stringify!(util_audio_from_interleaved_32f_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_from_interleaved_32f_v2) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_57),
            "::",
            stringify!(NDIlib_util_audio_from_interleaved_32f_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_58 {
    pub recv_free_string: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_string: *const ::std::os::raw::c_char,
        ),
    >,
    pub NDIlib_recv_free_string: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_string: *const ::std::os::raw::c_char,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_58() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_58> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_58>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_58))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_58>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_58))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_free_string) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_58),
            "::",
            stringify!(recv_free_string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_free_string) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_58),
            "::",
            stringify!(NDIlib_recv_free_string)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_59 {
    pub recv_ptz_is_supported:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_ptz_is_supported:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_59() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_59> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_59>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_59))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_59>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_59))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_is_supported) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_59),
            "::",
            stringify!(recv_ptz_is_supported)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_is_supported) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_59),
            "::",
            stringify!(NDIlib_recv_ptz_is_supported)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_60 {
    pub recv_recording_is_supported:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_recording_is_supported:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_60() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_60> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_60>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_60))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_60>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_60))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_recording_is_supported) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_60),
            "::",
            stringify!(recv_recording_is_supported)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_is_supported) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_60),
            "::",
            stringify!(NDIlib_recv_recording_is_supported)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_61 {
    pub recv_get_web_control: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> *const ::std::os::raw::c_char,
    >,
    pub NDIlib_recv_get_web_control: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> *const ::std::os::raw::c_char,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_61() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_61> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_61>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_61))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_61>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_61))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_get_web_control) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_61),
            "::",
            stringify!(recv_get_web_control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_get_web_control) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_61),
            "::",
            stringify!(NDIlib_recv_get_web_control)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_62 {
    pub recv_ptz_zoom: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, zoom_value: f32) -> bool,
    >,
    pub NDIlib_recv_ptz_zoom: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, zoom_value: f32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_62() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_62> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_62>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_62))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_62>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_62))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_zoom) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_62),
            "::",
            stringify!(recv_ptz_zoom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_zoom) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_62),
            "::",
            stringify!(NDIlib_recv_ptz_zoom)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_63 {
    pub recv_ptz_zoom_speed: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, zoom_speed: f32) -> bool,
    >,
    pub NDIlib_recv_ptz_zoom_speed: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, zoom_speed: f32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_63() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_63> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_63>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_63))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_63>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_63))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_zoom_speed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_63),
            "::",
            stringify!(recv_ptz_zoom_speed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_zoom_speed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_63),
            "::",
            stringify!(NDIlib_recv_ptz_zoom_speed)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_64 {
    pub recv_ptz_pan_tilt: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            pan_value: f32,
            tilt_value: f32,
        ) -> bool,
    >,
    pub NDIlib_recv_ptz_pan_tilt: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            pan_value: f32,
            tilt_value: f32,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_64() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_64> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_64>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_64))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_64>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_pan_tilt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_64),
            "::",
            stringify!(recv_ptz_pan_tilt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_pan_tilt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_64),
            "::",
            stringify!(NDIlib_recv_ptz_pan_tilt)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_65 {
    pub recv_ptz_pan_tilt_speed: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            pan_speed: f32,
            tilt_speed: f32,
        ) -> bool,
    >,
    pub NDIlib_recv_ptz_pan_tilt_speed: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            pan_speed: f32,
            tilt_speed: f32,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_65() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_65> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_65>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_65))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_65>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_65))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_pan_tilt_speed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_65),
            "::",
            stringify!(recv_ptz_pan_tilt_speed)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_pan_tilt_speed) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_65),
            "::",
            stringify!(NDIlib_recv_ptz_pan_tilt_speed)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_66 {
    pub recv_ptz_store_preset: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            preset_no: ::std::os::raw::c_int,
        ) -> bool,
    >,
    pub NDIlib_recv_ptz_store_preset: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            preset_no: ::std::os::raw::c_int,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_66() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_66> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_66>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_66))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_66>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_66))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_store_preset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_66),
            "::",
            stringify!(recv_ptz_store_preset)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_store_preset) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_66),
            "::",
            stringify!(NDIlib_recv_ptz_store_preset)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_67 {
    pub recv_ptz_recall_preset: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            preset_no: ::std::os::raw::c_int,
            speed: f32,
        ) -> bool,
    >,
    pub NDIlib_recv_ptz_recall_preset: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            preset_no: ::std::os::raw::c_int,
            speed: f32,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_67() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_67> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_67>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_67))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_67>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_67))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_recall_preset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_67),
            "::",
            stringify!(recv_ptz_recall_preset)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_recall_preset) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_67),
            "::",
            stringify!(NDIlib_recv_ptz_recall_preset)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_68 {
    pub recv_ptz_auto_focus:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_ptz_auto_focus:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_68() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_68> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_68>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_68))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_68>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_68))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_auto_focus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_68),
            "::",
            stringify!(recv_ptz_auto_focus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_auto_focus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_68),
            "::",
            stringify!(NDIlib_recv_ptz_auto_focus)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_69 {
    pub recv_ptz_focus: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, focus_value: f32) -> bool,
    >,
    pub NDIlib_recv_ptz_focus: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, focus_value: f32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_69() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_69> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_69>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_69))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_69>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_69))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_focus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_69),
            "::",
            stringify!(recv_ptz_focus)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_focus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_69),
            "::",
            stringify!(NDIlib_recv_ptz_focus)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_70 {
    pub recv_ptz_focus_speed: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, focus_speed: f32) -> bool,
    >,
    pub NDIlib_recv_ptz_focus_speed: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, focus_speed: f32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_70() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_70> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_70>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_70))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_70>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_70))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_focus_speed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_70),
            "::",
            stringify!(recv_ptz_focus_speed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_focus_speed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_70),
            "::",
            stringify!(NDIlib_recv_ptz_focus_speed)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_71 {
    pub recv_ptz_white_balance_auto:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_ptz_white_balance_auto:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_71() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_71> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_71>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_71))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_71>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_71))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_white_balance_auto) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_71),
            "::",
            stringify!(recv_ptz_white_balance_auto)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_white_balance_auto) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_71),
            "::",
            stringify!(NDIlib_recv_ptz_white_balance_auto)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_72 {
    pub recv_ptz_white_balance_indoor:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_ptz_white_balance_indoor:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_72() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_72> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_72>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_72))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_72>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_72))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recv_ptz_white_balance_indoor) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_72),
            "::",
            stringify!(recv_ptz_white_balance_indoor)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_white_balance_indoor) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_72),
            "::",
            stringify!(NDIlib_recv_ptz_white_balance_indoor)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_73 {
    pub recv_ptz_white_balance_outdoor:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_ptz_white_balance_outdoor:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_73() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_73> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_73>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_73))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_73>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_73))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recv_ptz_white_balance_outdoor) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_73),
            "::",
            stringify!(recv_ptz_white_balance_outdoor)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_white_balance_outdoor) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_73),
            "::",
            stringify!(NDIlib_recv_ptz_white_balance_outdoor)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_74 {
    pub recv_ptz_white_balance_oneshot:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_ptz_white_balance_oneshot:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_74() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_74> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_74>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_74))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_74>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_74))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recv_ptz_white_balance_oneshot) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_74),
            "::",
            stringify!(recv_ptz_white_balance_oneshot)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_white_balance_oneshot) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_74),
            "::",
            stringify!(NDIlib_recv_ptz_white_balance_oneshot)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_75 {
    pub recv_ptz_white_balance_manual: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, red: f32, blue: f32) -> bool,
    >,
    pub NDIlib_recv_ptz_white_balance_manual: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, red: f32, blue: f32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_75() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_75> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_75>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_75))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_75>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_75))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recv_ptz_white_balance_manual) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_75),
            "::",
            stringify!(recv_ptz_white_balance_manual)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_white_balance_manual) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_75),
            "::",
            stringify!(NDIlib_recv_ptz_white_balance_manual)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_76 {
    pub recv_ptz_exposure_auto:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_ptz_exposure_auto:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_76() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_76> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_76>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_76))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_76>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_76))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_exposure_auto) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_76),
            "::",
            stringify!(recv_ptz_exposure_auto)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_exposure_auto) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_76),
            "::",
            stringify!(NDIlib_recv_ptz_exposure_auto)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_77 {
    pub recv_ptz_exposure_manual: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, exposure_level: f32) -> bool,
    >,
    pub NDIlib_recv_ptz_exposure_manual: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, exposure_level: f32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_77() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_77> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_77>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_77))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_77>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_77))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_exposure_manual) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_77),
            "::",
            stringify!(recv_ptz_exposure_manual)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_exposure_manual) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_77),
            "::",
            stringify!(NDIlib_recv_ptz_exposure_manual)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_78 {
    pub recv_recording_start: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_filename_hint: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub NDIlib_recv_recording_start: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_filename_hint: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_78() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_78> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_78>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_78))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_78>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_78))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_recording_start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_78),
            "::",
            stringify!(recv_recording_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_78),
            "::",
            stringify!(NDIlib_recv_recording_start)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_79 {
    pub recv_recording_stop:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_recording_stop:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_79() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_79> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_79>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_79))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_79>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_79))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_recording_stop) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_79),
            "::",
            stringify!(recv_recording_stop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_stop) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_79),
            "::",
            stringify!(NDIlib_recv_recording_stop)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_80 {
    pub recv_recording_set_audio_level: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, level_dB: f32) -> bool,
    >,
    pub NDIlib_recv_recording_set_audio_level: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, level_dB: f32) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_80() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_80> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_80>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_80))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_80>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_80))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recv_recording_set_audio_level) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_80),
            "::",
            stringify!(recv_recording_set_audio_level)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_set_audio_level) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_80),
            "::",
            stringify!(NDIlib_recv_recording_set_audio_level)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_81 {
    pub recv_recording_is_recording:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
    pub NDIlib_recv_recording_is_recording:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> bool>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_81() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_81> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_81>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_81))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_81>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_81))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_recording_is_recording) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_81),
            "::",
            stringify!(recv_recording_is_recording)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_is_recording) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_81),
            "::",
            stringify!(NDIlib_recv_recording_is_recording)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_82 {
    pub recv_recording_get_filename: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> *const ::std::os::raw::c_char,
    >,
    pub NDIlib_recv_recording_get_filename: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> *const ::std::os::raw::c_char,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_82() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_82> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_82>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_82))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_82>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_82))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_recording_get_filename) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_82),
            "::",
            stringify!(recv_recording_get_filename)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_get_filename) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_82),
            "::",
            stringify!(NDIlib_recv_recording_get_filename)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_83 {
    pub recv_recording_get_error: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> *const ::std::os::raw::c_char,
    >,
    pub NDIlib_recv_recording_get_error: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t) -> *const ::std::os::raw::c_char,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_83() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_83> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_83>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_83))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_83>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_83))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_recording_get_error) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_83),
            "::",
            stringify!(recv_recording_get_error)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_get_error) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_83),
            "::",
            stringify!(NDIlib_recv_recording_get_error)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_84 {
    pub recv_recording_get_times: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_times: *mut NDIlib_recv_recording_time_t,
        ) -> bool,
    >,
    pub NDIlib_recv_recording_get_times: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_times: *mut NDIlib_recv_recording_time_t,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_84() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_84> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_84>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_84))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_84>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_84))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_recording_get_times) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_84),
            "::",
            stringify!(recv_recording_get_times)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_recording_get_times) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_84),
            "::",
            stringify!(NDIlib_recv_recording_get_times)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_85 {
    pub recv_create_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_recv_create_v3_t,
        ) -> NDIlib_recv_instance_t,
    >,
    pub NDIlib_recv_create_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_create_settings: *const NDIlib_recv_create_v3_t,
        ) -> NDIlib_recv_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_85() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_85> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_85>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_85))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_85>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_85))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_create_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_85),
            "::",
            stringify!(recv_create_v3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_create_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_85),
            "::",
            stringify!(NDIlib_recv_create_v3)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_86 {
    pub recv_connect: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, p_src: *const NDIlib_source_t),
    >,
    pub NDIlib_recv_connect: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_recv_instance_t, p_src: *const NDIlib_source_t),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_86() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_86> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_86>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_86))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_86>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_86))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_connect) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_86),
            "::",
            stringify!(recv_connect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_connect) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_86),
            "::",
            stringify!(NDIlib_recv_connect)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_87 {
    pub framesync_create: ::std::option::Option<
        unsafe extern "C" fn(p_receiver: NDIlib_recv_instance_t) -> NDIlib_framesync_instance_t,
    >,
    pub NDIlib_framesync_create: ::std::option::Option<
        unsafe extern "C" fn(p_receiver: NDIlib_recv_instance_t) -> NDIlib_framesync_instance_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_87() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_87> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_87>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_87))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_87>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_87))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_87),
            "::",
            stringify!(framesync_create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_framesync_create) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_87),
            "::",
            stringify!(NDIlib_framesync_create)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_88 {
    pub framesync_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_framesync_instance_t)>,
    pub NDIlib_framesync_destroy:
        ::std::option::Option<unsafe extern "C" fn(p_instance: NDIlib_framesync_instance_t)>,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_88() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_88> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_88>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_88))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_88>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_88))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_88),
            "::",
            stringify!(framesync_destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_framesync_destroy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_88),
            "::",
            stringify!(NDIlib_framesync_destroy)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_89 {
    pub framesync_capture_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v2_t,
            sample_rate: ::std::os::raw::c_int,
            no_channels: ::std::os::raw::c_int,
            no_samples: ::std::os::raw::c_int,
        ),
    >,
    pub NDIlib_framesync_capture_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v2_t,
            sample_rate: ::std::os::raw::c_int,
            no_channels: ::std::os::raw::c_int,
            no_samples: ::std::os::raw::c_int,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_89() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_89> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_89>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_89))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_89>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_89))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_capture_audio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_89),
            "::",
            stringify!(framesync_capture_audio)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_framesync_capture_audio) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_89),
            "::",
            stringify!(NDIlib_framesync_capture_audio)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_90 {
    pub framesync_free_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
    pub NDIlib_framesync_free_audio: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_90() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_90> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_90>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_90))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_90>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_90))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_free_audio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_90),
            "::",
            stringify!(framesync_free_audio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_framesync_free_audio) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_90),
            "::",
            stringify!(NDIlib_framesync_free_audio)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_91 {
    pub framesync_capture_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
            field_type: NDIlib_frame_format_type_e,
        ),
    >,
    pub NDIlib_framesync_capture_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
            field_type: NDIlib_frame_format_type_e,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_91() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_91> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_91>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_91))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_91>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_91))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_capture_video) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_91),
            "::",
            stringify!(framesync_capture_video)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_framesync_capture_video) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_91),
            "::",
            stringify!(NDIlib_framesync_capture_video)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_92 {
    pub framesync_free_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
        ),
    >,
    pub NDIlib_framesync_free_video: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_92() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_92> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_92>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_92))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_92>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_92))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_free_video) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_92),
            "::",
            stringify!(framesync_free_video)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_framesync_free_video) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_92),
            "::",
            stringify!(NDIlib_framesync_free_video)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_93 {
    pub util_send_send_audio_interleaved_32s: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_interleaved_32s_t,
        ),
    >,
    pub NDIlib_util_send_send_audio_interleaved_32s: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_interleaved_32s_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_93() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_93> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_93>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_93))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_93>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_93))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_send_send_audio_interleaved_32s) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_93),
            "::",
            stringify!(util_send_send_audio_interleaved_32s)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_send_send_audio_interleaved_32s) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_93),
            "::",
            stringify!(NDIlib_util_send_send_audio_interleaved_32s)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_94 {
    pub util_audio_to_interleaved_32s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_v2_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_32s_t,
        ),
    >,
    pub NDIlib_util_audio_to_interleaved_32s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_v2_t,
            p_dst: *mut NDIlib_audio_frame_interleaved_32s_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_94() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_94> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_94>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_94))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_94>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_94))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_to_interleaved_32s_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_94),
            "::",
            stringify!(util_audio_to_interleaved_32s_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_to_interleaved_32s_v2) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_94),
            "::",
            stringify!(NDIlib_util_audio_to_interleaved_32s_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_95 {
    pub util_audio_from_interleaved_32s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_32s_t,
            p_dst: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
    pub NDIlib_util_audio_from_interleaved_32s_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_src: *const NDIlib_audio_frame_interleaved_32s_t,
            p_dst: *mut NDIlib_audio_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_95() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_95> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_95>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_95))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_95>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_95))
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).util_audio_from_interleaved_32s_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_95),
            "::",
            stringify!(util_audio_from_interleaved_32s_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_util_audio_from_interleaved_32s_v2) as usize
                - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_95),
            "::",
            stringify!(NDIlib_util_audio_from_interleaved_32s_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_96 {
    pub send_get_source_name: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_send_instance_t) -> *const NDIlib_source_t,
    >,
    pub NDIlib_send_get_source_name: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_send_instance_t) -> *const NDIlib_source_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_96() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_96> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_96>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_96))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_96>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_96))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_get_source_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_96),
            "::",
            stringify!(send_get_source_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_get_source_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_96),
            "::",
            stringify!(NDIlib_send_get_source_name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_97 {
    pub send_send_audio_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v3_t,
        ),
    >,
    pub NDIlib_send_send_audio_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_send_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v3_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_97() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_97> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_97>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_97))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_97>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_97))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_send_audio_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_97),
            "::",
            stringify!(send_send_audio_v3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_send_send_audio_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_97),
            "::",
            stringify!(NDIlib_send_send_audio_v3)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_98 {
    pub util_V210_to_P216: ::std::option::Option<
        unsafe extern "C" fn(
            p_src_v210: *const NDIlib_video_frame_v2_t,
            p_dst_p216: *mut NDIlib_video_frame_v2_t,
        ),
    >,
    pub NDIlib_util_V210_to_P216: ::std::option::Option<
        unsafe extern "C" fn(
            p_src_v210: *const NDIlib_video_frame_v2_t,
            p_dst_p216: *mut NDIlib_video_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_98() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_98> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_98>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_98))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_98>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_98))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).util_V210_to_P216) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_98),
            "::",
            stringify!(util_V210_to_P216)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_util_V210_to_P216) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_98),
            "::",
            stringify!(NDIlib_util_V210_to_P216)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_99 {
    pub util_P216_to_V210: ::std::option::Option<
        unsafe extern "C" fn(
            p_src_p216: *const NDIlib_video_frame_v2_t,
            p_dst_v210: *mut NDIlib_video_frame_v2_t,
        ),
    >,
    pub NDIlib_util_P216_to_V210: ::std::option::Option<
        unsafe extern "C" fn(
            p_src_p216: *const NDIlib_video_frame_v2_t,
            p_dst_v210: *mut NDIlib_video_frame_v2_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_99() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_99> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_99>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_99))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_99>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_99))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).util_P216_to_V210) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_99),
            "::",
            stringify!(util_P216_to_V210)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_util_P216_to_V210) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_99),
            "::",
            stringify!(NDIlib_util_P216_to_V210)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_100 {
    pub routing_get_no_connections: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_routing_instance_t,
            timeout_in_ms: u32,
        ) -> ::std::os::raw::c_int,
    >,
    pub NDIlib_routing_get_no_connections: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_routing_instance_t,
            timeout_in_ms: u32,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_100() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_100> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_100>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_100))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_100>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_100))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).routing_get_no_connections) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_100),
            "::",
            stringify!(routing_get_no_connections)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_routing_get_no_connections) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_100),
            "::",
            stringify!(NDIlib_routing_get_no_connections)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_101 {
    pub routing_get_source_name: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_routing_instance_t) -> *const NDIlib_source_t,
    >,
    pub NDIlib_routing_get_source_name: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_routing_instance_t) -> *const NDIlib_source_t,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_101() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_101> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_101>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_101))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_101>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_101))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).routing_get_source_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_101),
            "::",
            stringify!(routing_get_source_name)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_routing_get_source_name) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_101),
            "::",
            stringify!(NDIlib_routing_get_source_name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_102 {
    pub recv_capture_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
            p_audio_data: *mut NDIlib_audio_frame_v3_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
    pub NDIlib_recv_capture_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_video_data: *mut NDIlib_video_frame_v2_t,
            p_audio_data: *mut NDIlib_audio_frame_v3_t,
            p_metadata: *mut NDIlib_metadata_frame_t,
            timeout_in_ms: u32,
        ) -> NDIlib_frame_type_e,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_102() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_102> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_102>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_102))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_102>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_102))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_capture_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_102),
            "::",
            stringify!(recv_capture_v3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_capture_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_102),
            "::",
            stringify!(NDIlib_recv_capture_v3)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_103 {
    pub recv_free_audio_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v3_t,
        ),
    >,
    pub NDIlib_recv_free_audio_v3: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            p_audio_data: *const NDIlib_audio_frame_v3_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_103() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_103> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_103>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_103))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_103>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_103))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_free_audio_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_103),
            "::",
            stringify!(recv_free_audio_v3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NDIlib_recv_free_audio_v3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_103),
            "::",
            stringify!(NDIlib_recv_free_audio_v3)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_104 {
    pub framesync_capture_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v3_t,
            sample_rate: ::std::os::raw::c_int,
            no_channels: ::std::os::raw::c_int,
            no_samples: ::std::os::raw::c_int,
        ),
    >,
    pub NDIlib_framesync_capture_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v3_t,
            sample_rate: ::std::os::raw::c_int,
            no_channels: ::std::os::raw::c_int,
            no_samples: ::std::os::raw::c_int,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_104() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_104> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_104>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_104))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_104>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_104))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_capture_audio_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_104),
            "::",
            stringify!(framesync_capture_audio_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_framesync_capture_audio_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_104),
            "::",
            stringify!(NDIlib_framesync_capture_audio_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_105 {
    pub framesync_free_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v3_t,
        ),
    >,
    pub NDIlib_framesync_free_audio_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_framesync_instance_t,
            p_audio_data: *mut NDIlib_audio_frame_v3_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_105() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_105> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_105>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_105))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_105>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_105))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_free_audio_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_105),
            "::",
            stringify!(framesync_free_audio_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_framesync_free_audio_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_105),
            "::",
            stringify!(NDIlib_framesync_free_audio_v2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_106 {
    pub framesync_audio_queue_depth: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_framesync_instance_t) -> ::std::os::raw::c_int,
    >,
    pub NDIlib_framesync_audio_queue_depth: ::std::option::Option<
        unsafe extern "C" fn(p_instance: NDIlib_framesync_instance_t) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_106() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_106> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_106>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_106))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_106>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_106))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framesync_audio_queue_depth) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_106),
            "::",
            stringify!(framesync_audio_queue_depth)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_framesync_audio_queue_depth) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_106),
            "::",
            stringify!(NDIlib_framesync_audio_queue_depth)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union NDIlib_v5__bindgen_ty_107 {
    pub recv_ptz_exposure_manual_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            iris: f32,
            gain: f32,
            shutter_speed: f32,
        ) -> bool,
    >,
    pub NDIlib_recv_ptz_exposure_manual_v2: ::std::option::Option<
        unsafe extern "C" fn(
            p_instance: NDIlib_recv_instance_t,
            iris: f32,
            gain: f32,
            shutter_speed: f32,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_NDIlib_v5__bindgen_ty_107() {
    const UNINIT: ::std::mem::MaybeUninit<NDIlib_v5__bindgen_ty_107> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5__bindgen_ty_107>(),
        8usize,
        concat!("Size of: ", stringify!(NDIlib_v5__bindgen_ty_107))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5__bindgen_ty_107>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5__bindgen_ty_107))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_ptz_exposure_manual_v2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_107),
            "::",
            stringify!(recv_ptz_exposure_manual_v2)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).NDIlib_recv_ptz_exposure_manual_v2) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(NDIlib_v5__bindgen_ty_107),
            "::",
            stringify!(NDIlib_recv_ptz_exposure_manual_v2)
        )
    );
}
#[test]
fn bindgen_test_layout_NDIlib_v5() {
    assert_eq!(
        ::std::mem::size_of::<NDIlib_v5>(),
        856usize,
        concat!("Size of: ", stringify!(NDIlib_v5))
    );
    assert_eq!(
        ::std::mem::align_of::<NDIlib_v5>(),
        8usize,
        concat!("Alignment of ", stringify!(NDIlib_v5))
    );
}
pub type NDIlib_v4_5 = NDIlib_v5;
pub type NDIlib_v4 = NDIlib_v5;
pub type NDIlib_v3 = NDIlib_v5;
pub type NDIlib_v2 = NDIlib_v5;
extern "C" {
    pub fn NDIlib_v5_load() -> *const NDIlib_v5;
}
extern "C" {
    pub fn NDIlib_v4_5_load() -> *const NDIlib_v4_5;
}
extern "C" {
    pub fn NDIlib_v4_load() -> *const NDIlib_v4;
}
extern "C" {
    pub fn NDIlib_v3_load() -> *const NDIlib_v3;
}
extern "C" {
    pub fn NDIlib_v2_load() -> *const NDIlib_v2;
}
